####################################################################################
# 파이썬 객체 지향 프로그래밍
####################################################################################

#######################################
# OOP란 무엇인가요?
#######################################
# OOP는 객체 지향 프로그래밍 의 약자입니다
# 파이썬은 객체 지향 언어로, 클래스와 객체를 사용하여 코드를 구조화함으로써 더 나은 구성과 재사용성을 확보할 수 있습니다.

#######################################
# 객체지향 프로그래밍의 장점
#######################################
# 프로그램에 명확한 구조를 제공합니다.
# 코드의 유지 관리, 재사용 및 디버깅을 더 쉽게 만들어 줍니다.
# 코드의 반복을 피하는 DRY( Don't Repeat Yourself ) 원칙을 지키는 데 도움이 됩니다.
# 더 적은 코드로 재사용 가능한 애플리케이션을 구축할 수 있도록 해줍니다.

# 팁: DRY 원칙은 동일한 코드를 두 번 이상 작성하지 않아야 한다는 것을 의미합니다.
#     반복되는 코드는 함수나 클래스로 옮겨 재사용하세요.

#######################################
# 클래스와 객체란 무엇인가요?
#######################################
# 클래스와 객체는 객체 지향 프로그래밍의 두 가지 핵심 개념입니다.
# 클래스는 객체가 어떤 모습이어야 하는지를 정의하고, 객체는 그 클래스를 기반으로 생성됩니다. 예를 들면 다음과 같습니다.
# Class	Objects
# Fruit	Apple, Banana, Mango
# Car	Volvo, Audi, Toyota

# 클래스로부터 객체를 생성하면, 해당 클래스 안에 정의된 모든 변수와 함수를 상속받게 됩니다.

# 다음 장에서는 다음 내용에 대해 배우게 됩니다.

# 클래스와 객체
# __init__() 메서드
# 자체 매개변수
# 속성 및 방법
# 유전 과 다형성
# 캡슐화 및 내부 클래스