####################################################################################
# 파이썬 변수
####################################################################################

#######################################
# 변수
#######################################
# 변수는 데이터 값을 저장하는 컨테이너입니다.

#######################################
# 변수 생성
#######################################
# Python에는 변수를 선언하는 명령이 없습니다.
# 변수는 처음으로 값을 할당하는 순간 생성됩니다.

# 예
x = 5
y = "John"
print(x)
print(y)
# 5
# John

# 변수는 특정 유형 으로 선언될 필요가 없으며 , 설정된 후에도 유형을 변경할 수 있습니다.

# 예
x = 4       # x is of type int
x = "Sally" # x is now of type str
print(x)
# Sally

#######################################
# 주조
#######################################
# 변수의 데이터 유형을 지정하려면 캐스팅을 사용하면 됩니다.
# 예
x = str(3)    # x will be '3'
y = int(3)    # y will be 3
z = float(3)  # z will be 3.0
# print(x); print(y); print(z)
# 3
# 3
# 3.0

#######################################
# 유형을 얻으세요
#######################################
# 함수를 사용하면 변수의 데이터 유형을 얻을 수 있습니다 type().

# 예
x = 5
y = "John"
print(type(x))
print(type(y))
# <class 'int'>
# <class 'str'>

#######################################
# 작은따옴표나 큰따옴표?
#######################################
# 문자열 변수는 작은따옴표나 큰따옴표를 사용하여 선언할 수 있습니다.

# 예
# x = "John"
# # is the same as
# x = 'John'

#######################################
# 대소문자 구분
#######################################
# 변수 이름은 대소문자를 구분합니다.

# 예
# 이렇게 하면 두 개의 변수가 생성됩니다.
a = 4
A = "Sally" # #A will not overwrite a
print(a); print(A);
# 4
# Sally

# QQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQ #
# Exercise
# QQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQ #
# What is a correct way to declare a Python variable?
# var x = 5
# #x = 5
# $x = 5
# x = 5     # Correct Answer!