####################################################################################
# What is Pyhton? 파이썬이란 무엇인가?
####################################################################################
# 파이썬은 인기 있는 프로그래밍 언어입니다. 귀도 반 로섬이 개발하여 1991년에 출시되었습니다.

# 다음과 같은 용도로 사용됩니다.

# - 웹 개발(서버 측)
# - 소프트웨어 개발
# - 수학
# - 시스템 스크립팅

# 파이썬은 무엇을 할 수 있나요?
# - Python을 사용하면 서버에서 웹 애플리케이션을 만들 수 있습니다.
# - Python은 소프트웨어와 함께 사용하여 워크플로를 생성할 수 있습니다.
# - Python은 데이터베이스 시스템에 연결할 수 있습니다. 또한 파일을 읽고 수정할 수도 있습니다.
# - 파이썬은 빅데이터를 처리하고 복잡한 수학 연산을 수행하는 데 사용할 수 있습니다.
# - Python은 신속한 프로토타입 제작이나 생산에 바로 투입 가능한 소프트웨어 개발에 사용될 수 있습니다.

# 왜 파이썬인가?
# - Python은 다양한 플랫폼(Windows, Mac, Linux, Raspberry Pi 등)에서 작동합니다.
# - 파이썬은 영어와 비슷한 간단한 구문을 가지고 있습니다.
# - 파이썬은 개발자가 다른 프로그래밍 언어보다 줄 수가 적은 프로그램을 작성할 수 있는 구문을 가지고 있습니다.
# - 파이썬은 인터프리터 시스템에서 실행되므로, 코드를 작성하자마자 바로 실행할 수 있습니다. 즉, 프로토타입을 매우 빠르게 개발할 수 있습니다.
# - Python은 절차적 방식, 객체 지향적 방식 또는 함수적 방식으로 처리할 수 있습니다.

# 알아두면 좋은 정보
# - Python의 가장 최신 주요 버전은 Python 3이며, 이 튜토리얼에서는 이를 사용할 것입니다.
# - 이 튜토리얼에서는 텍스트 편집기를 사용하여 Python을 작성합니다. Thonny, Pycharm, Netbeans, Eclipse와 같은 통합 개발 환경에서 Python을 작성할 수 있으며, 이러한 환경은 특히 대규모 Python 파일 컬렉션을 관리할 때 유용합니다.

# 다른 프로그래밍 언어와 비교한 Python 구문
# - 파이썬은 가독성을 중시하여 설계되었으며, 수학의 영향을 받아 영어와 유사한 면도 있습니다.
# - 파이썬은 다른 프로그래밍 언어가 세미콜론이나 괄호를 사용하는 것과 달리 줄바꿈을 사용하여 명령을 완성합니다.
# - 파이썬은 들여쓰기와 공백을 사용하여 범위를 정의합니다. 루프, 함수, 클래스 등의 범위가 여기에 해당합니다. 다른 프로그래밍 언어에서는 이러한 목적으로 중괄호를 사용하는 경우가 많습니다.
####################################################################################

print("Hello, World!")