####################################################################################
# 파이썬 출력 숫자
####################################################################################

#######################################
# 숫자 인쇄
#######################################
# print()이 함수를 사용하여 숫자를 표시할 수도 있습니다.
# 하지만 텍스트와 달리 숫자를 큰따옴표 안에 넣지 않습니다.

# 예
print(3)
print(358)
print(50000)
# 3
# 358
# 50000

# 함수 내부에서 수학 연산을 수행할 수도 있습니다 print().
# 예
print(3 + 3)
print(2 * 5)
# 6
# 10

#######################################
# 텍스트와 숫자 혼합
#######################################
# 텍스트와 숫자를 쉼표로 구분하여 하나의 출력으로 결합할 수 있습니다.

# 예
print("I am", 25, "years old.")
# I am 25 years old.