####################################################################################
# 파이썬 연산자
####################################################################################

# 연산자는 변수와 값에 대한 연산을 수행하는 데 사용됩니다.
# 아래 예에서 우리는 +연산자를 사용하여 두 값을 더합니다.

# 예
print(10 + 5)
# 15
# 연산자 +는 위의 예처럼 두 값을 더하는 데 자주 사용되지만 변수와 값 또는 두 변수를 더하는 데에도 사용할 수 있습니다.

# 예
sum1 = 100 + 50      # 150 (100 + 50)
sum2 = sum1 + 250    # 400 (150 + 250)
sum3 = sum2 + sum2   # 800 (400 + 400)
print(sum1)
print(sum2)
print(sum3)
# 150
# 400
# 800

#######################################
# Python은 연산자를 다음 그룹으로 나눕니다.
#######################################
# 산술 연산자
# 할당 연산자
# 비교 연산자
# 논리 연산자
# 항등 연산자
# 멤버십 운영자
# 비트 연산자